{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c74c300d",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/mehrzad/.local/lib/python3.10/site-packages/tqdm/auto.py:22: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/home/mehrzad/anaconda3/envs/dbpedia/bin/python\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "\n",
    "from transformers import AutoTokenizer, AutoModelForCausalLM\n",
    "import transformers\n",
    "import torch\n",
    "\n",
    "print(sys.executable)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2969db3f",
   "metadata": {},
   "source": [
    "#\n",
    "# Falcon 1B"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "12eec921",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loading tiiuae/falcon-rw-1b requires to execute some code in that repo, you can inspect the content of the repository at https://hf.co/tiiuae/falcon-rw-1b. You can dismiss this prompt by passing `trust_remote_code=True`.\n",
      "Do you accept? [y/N] y\n",
      "Loading tiiuae/falcon-rw-1b requires to execute some code in that repo, you can inspect the content of the repository at https://hf.co/tiiuae/falcon-rw-1b. You can dismiss this prompt by passing `trust_remote_code=True`.\n",
      "Do you accept? [y/N] y\n",
      "Loading tiiuae/falcon-rw-1b requires to execute some code in that repo, you can inspect the content of the repository at https://hf.co/tiiuae/falcon-rw-1b. You can dismiss this prompt by passing `trust_remote_code=True`.\n",
      "Do you accept? [y/N] y\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Xformers is not installed correctly. If you want to use memory_efficient_attention to accelerate training use the following command to install Xformers\n",
      "pip install xformers.\n",
      "The model 'FalconForCausalLM' is not supported for text-generation. Supported models are ['BartForCausalLM', 'BertLMHeadModel', 'BertGenerationDecoder', 'BigBirdForCausalLM', 'BigBirdPegasusForCausalLM', 'BioGptForCausalLM', 'BlenderbotForCausalLM', 'BlenderbotSmallForCausalLM', 'BloomForCausalLM', 'CamembertForCausalLM', 'CodeGenForCausalLM', 'CpmAntForCausalLM', 'CTRLLMHeadModel', 'Data2VecTextForCausalLM', 'ElectraForCausalLM', 'ErnieForCausalLM', 'GitForCausalLM', 'GPT2LMHeadModel', 'GPT2LMHeadModel', 'GPTBigCodeForCausalLM', 'GPTNeoForCausalLM', 'GPTNeoXForCausalLM', 'GPTNeoXJapaneseForCausalLM', 'GPTJForCausalLM', 'LlamaForCausalLM', 'MarianForCausalLM', 'MBartForCausalLM', 'MegaForCausalLM', 'MegatronBertForCausalLM', 'MvpForCausalLM', 'OpenLlamaForCausalLM', 'OpenAIGPTLMHeadModel', 'OPTForCausalLM', 'PegasusForCausalLM', 'PLBartForCausalLM', 'ProphetNetForCausalLM', 'QDQBertLMHeadModel', 'ReformerModelWithLMHead', 'RemBertForCausalLM', 'RobertaForCausalLM', 'RobertaPreLayerNormForCausalLM', 'RoCBertForCausalLM', 'RoFormerForCausalLM', 'RwkvForCausalLM', 'Speech2Text2ForCausalLM', 'TransfoXLLMHeadModel', 'TrOCRForCausalLM', 'XGLMForCausalLM', 'XLMWithLMHeadModel', 'XLMProphetNetForCausalLM', 'XLMRobertaForCausalLM', 'XLMRobertaXLForCausalLM', 'XLNetLMHeadModel', 'XmodForCausalLM'].\n"
     ]
    }
   ],
   "source": [
    "device = \"cuda:0\" if torch.cuda.is_available() else \"cpu\"\n",
    "\n",
    "\n",
    "checkpoint = \"tiiuae/falcon-rw-1b\"\n",
    "\n",
    "\n",
    "tokenizer = AutoTokenizer.from_pretrained(checkpoint)\n",
    "pipeline = transformers.pipeline(\n",
    "    \"text-generation\",\n",
    "    model=checkpoint,\n",
    "    tokenizer=tokenizer,\n",
    "    torch_dtype=torch.bfloat16,\n",
    "    device_map=device,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ac64b1da",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: SPARQL Query for: what is the capital of Japan?\n",
      "- I need the capital of Japan in English (with the Japanese characters, please).\n",
      "- I'm a beginner in English and I need to find out the capital of Japan\n",
      "- I have to find out the capital of Japan\n",
      "- I have to find the capital of Japan\n",
      "- I want to find the capital of Japan\n",
      "- I would like to see the capital of Japan\n",
      "- I'm looking for the capital of Japan\n",
      "- I need to find out the capital of Japan\n",
      "- I need to find out the capital of Japan\n",
      "- I need to find out the capital of Japan\n",
      "- I need to find out the capital of Japan\n",
      "- I need to find out the capital of Japan\n",
      "- I need to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find the capital of Japan\n",
      "- I'm trying to find out the capital of Japan\n",
      "- I'm trying to find the capital of Japan\n",
      "- I'm trying to find the capital\n",
      "CPU times: user 4.9 s, sys: 47.4 ms, total: 4.95 s\n",
      "Wall time: 5.16 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = \"SPARQL Query for: what is the capital of Japan?\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b2b090cf",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "\n",
      "input= SPARQL Query for What is the capital of Germany?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Germany dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "\n",
      "input= SPARQL Query What is the capital of China?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:China dbo:capital ?capital .\n",
      "}\n",
      "}\n",
      "}\n",
      "This output is from a SQL query on DBpedia’s ontology of Germany. The first query shows the capital as Berlin. The second query shows the capital as Frankfurt. These two examples show that the German capital and the Chinese capital are not the same. However, they are both correct.\n",
      "The German capital, Berlin, is the correct German capital; therefore, it must be used as the capital.\n",
      "In a way, the capital of China is a little confusing, because it is a city. If it were a capital, it would be a city as well. In the end, this question is a little tricky. However, you will get to know the correct capital of China in the end..\n",
      "CPU times: user 1.83 s, sys: 0 ns, total: 1.83 s\n",
      "Wall time: 1.9 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "\n",
    "input= SPARQL Query for What is the capital of Germany?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Germany dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "\n",
    "input= SPARQL Query What is the capital of China?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:China dbo:capital ?capital .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "6e2d6f9b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query What is the capital of France?\n",
      "\n",
      "\n",
      "input= SPARQL Query What is the value of the year?\n",
      "What is a good example of an RDF graph?\n",
      "The best way to learn how to use RDF is to start with an RDF Graph. In this example, we will create a simple SPARQL query that will return the value of the year. This graph is an RDF graph.\n",
      "How do you use graphviz to create a RDF graph?\n",
      "Here is a simple Graph.\n",
      "How do you create an RDF graph in R?\n",
      "To create a RDF graph, you need two files: a source file for the data (a list of values or objects), and a target file for the RDF graph. This target file must be a text document. The following example shows how to do that.\n",
      "What are RDF graphs?\n",
      "In a nutshell, RDF graphs are a representation of data. This can be a data set, a data structure (e.g. a relational table), or an RDF triplestructure.\n",
      "How does RDF work?\n",
      "RDF (Resource Description Framework) is an OWL-based standard that aims to provide a common vocabulary to describe web pages, documents, databases, etc. This vocabulary will allow us to link these resources (web pages, documents, etc) together.\n",
      "How do I use RDF to build an RDF graph?\n",
      "To create an RDF graph, you need two files: a source file for the data (a list of values or objects), and a target file for the RDF graph.\n",
      "How do I use RDF to create a web page?\n",
      "The following example will create a simple RDF Graph to display an HTML page. This will use the RDF Graph Tool.\n",
      "CPU times: user 4.31 s, sys: 0 ns, total: 4.31 s\n",
      "Wall time: 4.31 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query What is the capital of France?\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "7cc44ffc",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "\n",
      "input= SPARQL Query for What is the capital of Germany?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Iran dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "\n",
      "input= SPARQL Query What is the capital of China?\n",
      "out\n",
      "\n",
      "\n",
      "input= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT?capital \n",
      "WHERE {\n",
      "?capital {\n",
      " }\n",
      "}\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT?capital \n",
      "WHERE {\n",
      "!?capital }\n",
      "}\n",
      "input= PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT?capital \n",
      "WHERE {\n",
      "?capital {\n",
      " }\n",
      "}\n",
      "Output from the query above:\n",
      "<?p=\"{?capital}\"?>?capital\n",
      "The query outputs: <?p=\"{?capital}\"?>?capital\n",
      "The first element of the?p array is the value for the?capital field of the resource.\n",
      "The first element of the?p array is the value for the?capital field of the resource.\n",
      "A resource is an object in RDF. RDF can be thought in three parts: 1) an object in the RDF vocabulary (e.g., an object that\n",
      "CPU times: user 2.86 s, sys: 0 ns, total: 2.86 s\n",
      "Wall time: 2.86 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "\n",
    "input= SPARQL Query for What is the capital of Germany?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Iran dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "\n",
    "input= SPARQL Query What is the capital of China?\n",
    "out\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e0d8e291",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "\n",
      "input= SPARQL Query for What is the capital of Germany?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Iran dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "\n",
      "input= SPARQL Query What is the capital of China?\n",
      "\n",
      "\n",
      "input= SPARQL Query For what is the capital of China?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT?capital \n",
      "WHERE {\n",
      "  dbr:China dbo:capital?capital.\n",
      "}\n",
      "}\n",
      "The capital of Germany is Berlin, and the capital of Iran is Teheran.\n",
      "- Posted using Chat Catcher\n",
      "- Login to post comments\n",
      "-\n",
      "CPU times: user 1.38 s, sys: 0 ns, total: 1.38 s\n",
      "Wall time: 1.38 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "\n",
    "input= SPARQL Query for What is the capital of Germany?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Iran dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "\n",
    "input= SPARQL Query What is the capital of China?\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "09c25a86",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      " dbr:Japan dbo:capital?capital.\n",
      "}\n",
      "}\n",
      "CPU times: user 204 ms, sys: 0 ns, total: 204 ms\n",
      "Wall time: 203 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "adca361f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Belgium?\n",
      "output=\n",
      "\n",
      "\n",
      "output-\n",
      "output-\n",
      "output-\n",
      "Output 1: the capital of Belgium\n",
      "output-\n",
      "output-\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "Output 2: the capital of Belgium in a different format\n",
      "output-\n",
      "output=\n",
      "output-\n",
      "output=\n",
      "output=\n",
      "Output 3: a different format for the capital of Belgium\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "Output 4: what is the capital of France?\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "input=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "input= SPARQL Query for what is the capital of France?\n",
      "output=\n",
      "output=\n",
      "Output 5: the capital of France in a different format\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "output=\n",
      "CPU times: user 3.66 s, sys: 0 ns, total: 3.66 s\n",
      "Wall time: 3.66 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Belgium?\n",
    "output=\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "4ea68ebd",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the population of Japan?\n",
      "output=\n",
      "> SELECT *\n",
      "> FROM population WHERE (\n",
      "> (\n",
      "> input= “Japan” or input= “Japan” )\n",
      "> or\n",
      "> (\n",
      "> input= “Japan” or input= “Japan” )\n",
      "> and\n",
      "> (\n",
      "> input= \"Japan\" or input= \"Japan\") or\n",
      "> input= \"Japan\"\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the population of Japan?\n",
    "output=\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=100,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "3117b57b",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the capital of Germany?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Germany dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?population \n",
      "WHERE {\n",
      "  dbr:Japan dbo:populationTotal ?population .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of France?\n",
      "output=\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the capital of Germany?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Germany dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the population of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?population \n",
    "WHERE {\n",
    "  dbr:Japan dbo:populationTotal ?population .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the population of France?\n",
    "output=\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=500,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    "    pad_token_id = 50256\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "2bca6ddc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "50256"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tokenizer.eos_token_id\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "775f33e7",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the capital of Germany?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Germany dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?population \n",
      "WHERE {\n",
      "  dbr:Japan dbo:populationTotal ?population .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of France?\n",
      "output=\n",
      "\n",
      "\n",
      "\n",
      "input= SPARQL Query for what is the population of Germany?\n",
      "output= ?population \n",
      "WHERE {\n",
      "?population \n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the capital of Austria?\n",
      "output= \n",
      "}\n",
      "\n",
      "output= SELECT?capital \n",
      "WHERE {\n",
      "?capital {\n",
      "?capital {\n",
      "?capital {\n",
      "?population \n",
      "}\n",
      "}\n",
      "}\n",
      "}\n",
      "input= SPARQL Query for who is the Prime Minister of Australia?\n",
      "output= \n",
      "\n",
      "?PM?name?party\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of Austria?\n",
      "output= \n",
      "?population \n",
      "WHERE {\n",
      "?population \n",
      "}\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of Austria?\n",
      "output= \n",
      "?population \n",
      "WHERE {\n",
      "?population \n",
      "}\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of Austria?\n",
      "output= \n",
      "?population \n",
      "WHERE {\n",
      "?population \n",
      "}\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of Austria?\n",
      "output= \n",
      "?population \n",
      "WHERE {\n",
      "?population \n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the capital of Germany?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Germany dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the population of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?population \n",
    "WHERE {\n",
    "  dbr:Japan dbo:populationTotal ?population .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the population of France?\n",
    "output=\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=500,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    "    pad_token_id = 50256\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "75f32244",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "245"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(tokenizer(prompt)['input_ids'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "11a4edfe",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/mehrzad/anaconda3/envs/dbpedia/lib/python3.10/site-packages/transformers/pipelines/base.py:1081: UserWarning: You seem to be using the pipelines sequentially on GPU. In order to maximize efficiency please use a dataset\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the capital of Germany?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Germany dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?population \n",
      "WHERE {\n",
      "  dbr:Japan dbo:populationTotal ?population .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of France?\n",
      "output=\n",
      "\n",
      " dba:France dbr:Population \n",
      "WHERE {\n",
      "  dbr:Germany dbo:population ?population.\n",
      "}\n",
      "\n",
      "input= SPARQL Query for what is the population of France?\n",
      "output= PREFIX dbo: <http://\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the capital of Germany?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Germany dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the population of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?population \n",
    "WHERE {\n",
    "  dbr:Japan dbo:populationTotal ?population .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for what is the population of France?\n",
    "output=\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=300,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    "    pad_token_id = 50256\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "553e7fc8",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output=\n",
      "I have to write code in PHP?\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output=\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=300,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    "    pad_token_id = 50256\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "842e753f",
   "metadata": {},
   "source": [
    "#\n",
    "# CodeGen-350M-multi\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "92eac866",
   "metadata": {},
   "outputs": [],
   "source": [
    "checkpoint = \"Salesforce/codegen-350M-multi\"\n",
    "\n",
    "\n",
    "tokenizer = AutoTokenizer.from_pretrained(checkpoint)\n",
    "pipeline = transformers.pipeline(\n",
    "    \"text-generation\",\n",
    "    model=checkpoint,\n",
    "    tokenizer=tokenizer,\n",
    "    torch_dtype=torch.bfloat16,\n",
    "    device_map=device,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "eedcd271",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: SPARQL Query for: what is the capital of Japan?\n",
      " *\n",
      " * @author  Benjamin Bengfort <benjamin@bengfort.com>\n",
      " * @author  Ricardo Cerqueira - 2015\n",
      " * @version $Id$\n",
      " *\n",
      " * @par\n",
      " * $Id$\n",
      " */\n",
      "//------------------------------------------------------------------------------\n",
      "// Copyright (C) 2013, The Regents of the University of California\n",
      "// See README in root directory for license.\n",
      "//------------------------------------------------------------------------------\n",
      "\n",
      "#include \"query.h\"\n",
      "\n",
      "//------------------------------------------------------------------------------\n",
      "// Private methods\n",
      "//------------------------------------------------------------------------------\n",
      "\n",
      "/**\n",
      " * Return the capital of Japan.\n",
      " */\n",
      "Query::Value Query::Capitals( const QString& query ) const\n",
      "{\n",
      "    // Build the Query object for the query\n",
      "    Query q( query );\n",
      "\n",
      "    // Create the JSON object\n",
      "    q.SetJSON( true );\n",
      "\n",
      "    // Retrieve the results\n",
      "    QVariant\n"
     ]
    }
   ],
   "source": [
    "prompt = \"SPARQL Query for: what is the capital of Japan?\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=200,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "070bf975",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for What is the capital of Germany?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Germany dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query What is the capital of China?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:China dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query What is the capital of Spain?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Spain dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query What is the capital of Norway?\n",
      "output=\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT?capital \n",
      "WHERE {\n",
      "  dbr:Norway dbo:capital?capital.\n",
      "}\n",
      "\n",
      "input= SPARQL Query What is the capital of Belgium?\n",
      "output= PREFIX dbo: <http://db\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for What is the capital of Germany?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Germany dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query What is the capital of China?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:China dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query What is the capital of Spain?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Spain dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query What is the capital of Norway?\n",
    "output=\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "a24576b7",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Thailand?\n",
      "output=\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Thailand?\n",
    "output=\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e5f9eeb9",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8e2a3e5b",
   "metadata": {},
   "outputs": [],
   "source": [
    "checkpoint = \"EleutherAI/gpt-neo-2.7B\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dcb1b232",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "616a370a",
   "metadata": {},
   "source": [
    "#\n",
    "# GPT-NEO-2.7B\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "9dfea316",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Xformers is not installed correctly. If you want to use memory_efficient_attention to accelerate training use the following command to install Xformers\n",
      "pip install xformers.\n"
     ]
    }
   ],
   "source": [
    "device = \"cuda:0\" if torch.cuda.is_available() else \"cpu\"\n",
    "\n",
    "\n",
    "checkpoint = \"EleutherAI/gpt-neo-2.7B\"\n",
    "\n",
    "\n",
    "tokenizer = AutoTokenizer.from_pretrained(checkpoint)\n",
    "pipeline = transformers.pipeline(\n",
    "    \"text-generation\",\n",
    "    model=checkpoint,\n",
    "    tokenizer=tokenizer,\n",
    "    torch_dtype=torch.bfloat16,\n",
    "    device_map=device,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "04c40ee2",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: SPARQL Query for: what is the capital of Japan?\n",
      "\n",
      "I'm writing a program to search an RDF database and I need a way to get the capital of Japan. I don't know anything about RDF, but I know the following:\n",
      "\n",
      "Japan is a country, which has a capital, which is Tokyo.\n",
      "A country is made of a number of provinces, which is Japan's largest, so I would expect to find a query for \"Japan\", but not \"Japan, the capital of\".\n",
      "\n",
      "So, I'm wondering if there is a way to search for \"Japan, the capital of\", in an RDF database (assuming the RDF database is in a JSON format) and if it exists, whether I should write my own query for it, or use a query that already exists?\n",
      "\n",
      "A:\n",
      "\n",
      "The query you are looking for is \"Japan, the capital of\". However, you should use the URI of Tokyo in your\n"
     ]
    }
   ],
   "source": [
    "prompt = \"SPARQL Query for: what is the capital of Japan?\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=200,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "fdc700fa",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Japan?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query for What is the capital of Germany?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Germany dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query What is the capital of China?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:China dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query What is the capital of Spain?\n",
      "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Spain dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= SPARQL Query What is the capital of Norway?\n",
      "output=\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT?capital \n",
      "WHERE {\n",
      "  dbr:Norway dbo:capital?capital.\n",
      "                                       }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Japan?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query for What is the capital of Germany?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Germany dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query What is the capital of China?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:China dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query What is the capital of Spain?\n",
    "output= PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Spain dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= SPARQL Query What is the capital of Norway?\n",
    "output=\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=500,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "cc1d496a",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Thailand?\n",
      "output=\n",
      "\n",
      "  <http://dbpedia.org/sparql>\n",
      "  <http://dbpedia.org/sparql>\n",
      "\n",
      "where <http://dbpedia.org/sparql> is the SPARQL endpoint of DBpedia, and\n",
      "\n",
      "\n",
      "input: a SPARQL query\n",
      "output:  the result of this query in the form of a graph\n",
      "\n",
      "\n",
      "input= SPARQL Query for what is the capital of Thailand?\n",
      "output=\n",
      "\n",
      "  <http://dbpedia.org/sparql>\n",
      "  <http://dbpedia.org/sparql>\n",
      "\n",
      "where <http://dbpedia.org/sparql> is the SPARQL endpoint of DBpedia, and\n",
      "\n",
      "\n",
      "output: the result of this query in the form of a graph\n",
      "\n",
      "\n",
      "output=\n",
      "\n",
      "  <http://dbpedia.org/sparql>\n",
      "\n",
      "where <http://dbpedia.org/sparql> is the SPARQL endpoint of DBpedia\n",
      "\n",
      "*/\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Thailand?\n",
    "output=\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "    eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "b8c9cddf",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= SPARQL Query for what is the capital of Thailand?\n",
      "output=\n",
      "\n",
      "\n",
      "\n",
      "# The query below uses the same input and returns the same result as the\n",
      "# query above.\n",
      "\n",
      "SPARQL =\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "# The above query uses the \"SPARQL\" function to query SPARQL and returns\n",
      "# the value \"Thailand\" in output.\n",
      "\n",
      "spqr = spqr { \t\t\n",
      "    \"?sparql\"   \t\t\t\n",
      "    \"?sparql\" \t\t\n",
      "}\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "# The above query uses the \"SPARQL\" function to query SPARQL and returns\n",
      "# null in output.\n",
      "\n",
      "spqr null\n",
      "\n",
      "\n",
      "\n",
      "\n",
      "    </textarea>\n",
      "  </div>\n",
      "  <script>\n",
      "    var editor = CodeMirror.fromTextArea(document.getElementById(\"code2\"), {\n",
      "      mode: \"text/x-sparql\"\n",
      "    });\n",
      "  </script>\n",
      "\n",
      "  <p><strong>MIME types defined:</strong> <code>application/sparql-query</code>.</p>\n",
      "\n",
      "  </article>\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= SPARQL Query for what is the capital of Thailand?\n",
    "output=\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=400,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "#     eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "00e974ad",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n",
      "Input length of input_ids is 1254, but `max_length` is set to 1000. This can lead to unexpected behavior. You should consider increasing `max_new_tokens`.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= Capital of Japan\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Japan dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of United States\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:United_States dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of China\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:China dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of France\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:France dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "# Capital of Germany\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Germany dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Canada\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Canada dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Australia\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Australia dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of India\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:India dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Russia\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Russia dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Spain\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Spain dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Brazil\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Brazil dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "# Capital of South Africa\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:South_Africa dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Italy\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Italy dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Mexico\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Mexico dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Argentina\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Argentina dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Turkey\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Turkey dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Iran\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Iran dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Egypt\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Egypt dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Indonesia\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "SELECT ?capital \n",
      "WHERE {\n",
      "  dbr:Indonesia dbo:capital ?capital .\n",
      "}\n",
      "\n",
      "input= Capital of Sweden\n",
      "output=\n",
      "\n",
      " \n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= Capital of Japan\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Japan dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of United States\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:United_States dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of China\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:China dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of France\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:France dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "# Capital of Germany\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Germany dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Canada\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Canada dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Australia\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Australia dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of India\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:India dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Russia\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Russia dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Spain\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Spain dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Brazil\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Brazil dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "# Capital of South Africa\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:South_Africa dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Italy\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Italy dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Mexico\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Mexico dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Argentina\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Argentina dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Turkey\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Turkey dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Iran\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Iran dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Egypt\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Egypt dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Indonesia\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "SELECT ?capital \n",
    "WHERE {\n",
    "  dbr:Indonesia dbo:capital ?capital .\n",
    "}\n",
    "\n",
    "input= Capital of Sweden\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=1000,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "#     eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "b251b00b",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/mehrzad/anaconda3/envs/dbpedia/lib/python3.10/site-packages/transformers/pipelines/base.py:1081: UserWarning: You seem to be using the pipelines sequentially on GPU. In order to maximize efficiency please use a dataset\n",
      "  warnings.warn(\n",
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "input= Capital of Sweden\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "input= Capital of Sweden\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "#     max_length=1000,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "#     eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "7c266eeb",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "Write an example fo sparql query over dbpedia\n",
      "\n",
      "I am new to sparqler. I am writing some example query in sparql to fetch the result of a query, and I am not able to get the exact output as given\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "Write an example fo sparql query over dbpedia\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "#     max_length=1000,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "#     eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "9652234d",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "\n",
      "Translate the following sentence into a SPARQL query: find capital of Japan\n",
      "\n",
      "    SELECT?c?o WHERE{\n",
      "   ?c <http://purl.org/dc/elements/1.\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "\n",
    "Translate the following sentence into a SPARQL query: find capital of Japan\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "#     max_length=1000,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "#     eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "469061f3",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "\n",
      "Translate the following sentence into a SPARQL query for DBpedia: find capital of Japan\n",
      "\n",
      "\n",
      "\n",
      "?capital.name\n",
      "\n",
      "?city.name\n",
      "\n",
      "?population.n\n",
      "\n",
      "?population.i\n",
      "\n",
      "?population\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "\n",
    "Translate the following sentence into a SPARQL query for DBpedia: find capital of Japan\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "#     max_length=1000,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "#     eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "5a5f0cb7",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "\n",
      "Fill in the SPARQL query template to find the capital of a specific country. \n",
      "The country's name is 'Germany'.\n",
      "The template is: \n",
      "'SELECT ?capital WHERE { dbr:\" \" dbo:capital ?capital . }'\n",
      "\n",
      "    SELECT * WHERE {\n",
      "\n",
      "                         ?capital a geo:Point ;\n",
      "                                                                 <-- \n",
      "    dbo:capital geo:Point.\n",
      "                          }\n",
      "\n",
      "This query will return 'Frankfurt'\n",
      "I've been trying to use the SPARQL function ST_DWithin in order to find the capital of a specific country. \n",
      "In the following code, I've created a function to create an RDF query. \n",
      "\n",
      "#include <iostream>\n",
      "#include <string>\n",
      "#include <sparql/sparql_execution_context.h>\n",
      "#include <spar\n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "\n",
    "Fill in the SPARQL query template to find the capital of a specific country. \n",
    "The country's name is 'Germany'.\n",
    "The template is: \n",
    "'SELECT ?capital WHERE { dbr:\" \" dbo:capital ?capital . }'\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=300,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "#     eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "39d652ed",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Setting `pad_token_id` to `eos_token_id`:50256 for open-end generation.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: \n",
      "\n",
      "Translate the following question into SPARQL query towards DBpedia knowledge base using these prefixes:\n",
      "\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "\n",
      "Q: What is the capital of Japan\n",
      "A:\n",
      "\n",
      "                                                                                                                                                                                                                                    \n"
     ]
    }
   ],
   "source": [
    "\n",
    "prompt = \"\"\"\n",
    "\n",
    "Translate the following question into SPARQL query towards DBpedia knowledge base using these prefixes:\n",
    "\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "\n",
    "Q: What is the capital of Japan\n",
    "A:\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "sequences = pipeline(\n",
    "    prompt,\n",
    "    max_length=00,\n",
    "    do_sample=True,\n",
    "    top_k=10,\n",
    "    num_return_sequences=1,\n",
    "#     eos_token_id=tokenizer.eos_token_id,\n",
    ")\n",
    "for seq in sequences:\n",
    "    print(f\"Result: {seq['generated_text']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "27a67196",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "89074739",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "dbpedia-env",
   "language": "python",
   "name": "dbpedia"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
