{
  "dataset" : {
    "id" : "qald-9-train-multilingual"
  },
  "questions" : [ {
    "id" : "1",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Liste alle Brettspiele von GMT. ",
      "keywords" : "Brettspiel ,  GMT"
    }, {
      "language" : "ru",
      "string" : "Список все настольные игры от ВРЕМЯ ПО ГРИНВИЧУ. ",
      "keywords" : "настольная игра ,  время по Гринвичу "
    }, {
      "language" : "pt",
      "string" : "Liste todos jogos de tabuleiro da GMT. ",
      "keywords" : "jogo de tabuleiro ,  GMT "
    }, {
      "language" : "en",
      "string" : "List all boardgames by GMT.",
      "keywords" : "boardgame, GMT"
    }, {
      "language" : "hi_IN",
      "string" : "जीएमटी द्वारा सभी बोर्ड गेम सूचीबद्ध करें।",
      "keywords" : "विशेष प्रकार के बोर्ड या पट्टे के खेल जैसे शतरंज, साँप सीढ़ी आदि, जीएमटी"
    }, {
      "language" : "fa",
      "string" : "همه بازی های تخته ای GMT را لیست کن",
      "keywords" : "  بازی تخته,    GMT"
    }, {
      "language" : "it",
      "string" : "Elenco tutti giochi da tavolo di GMT. ",
      "keywords" : "gioco da tavolo ,  GMT "
    }, {
      "language" : "fr",
      "string" : "liste tout jeux de plateau par GMT. ",
      "keywords" : "jeu de plateau ,  GMT "
    }, {
      "language" : "ro",
      "string" : "Listă toate jocuri de masă de GMT. ",
      "keywords" : "jocuri pe ,  GMT "
    }, {
      "language" : "es",
      "string" : "Lista todas juegos de mesa por GMT. ",
      "keywords" : "juego de mesa ,  GMT "
    }, {
      "language" : "nl",
      "string" : "Lijst alle bordspellen door GMT. ",
      "keywords" : "bordspel ,  GMT "
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Washington's_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fields_of_Fire_(game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_World_At_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sword_of_Rome"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Twilight_Struggle"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chandragupta_(board_game)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "13",
    "answertype" : "number",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Gib mir die Enkel von Bruce Lee.",
      "keywords" : "Bruce Lee, Enkel"
    }, {
      "language" : "ru",
      "string" : "Дайте меня  внучата из Брюс Lee. ",
      "keywords" : "Брюс подветренный ,  внучата "
    }, {
      "language" : "pt",
      "string" : "Me dê os netos de Bruce Lee. ",
      "keywords" : "Bruce Lee ,  netos "
    }, {
      "language" : "en",
      "string" : "Give me the grandchildren of Bruce Lee.",
      "keywords" : "Bruce Lee, grandchildren"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे ब्रूस ली के पोते के नाम दो।",
      "keywords" : "ब्रूस ली ,  पोते "
    }, {
      "language" : "fa",
      "string" : "نوه های بروس لی را لیست کن.",
      "keywords" : "  بروس لی,    نوه ها"
    }, {
      "language" : "it",
      "string" : "Dammi i nipoti di Bruce Lee.",
      "keywords" : "Bruce Lee, nipoti"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les petit-enfants de Bruce Lee.",
      "keywords" : "petit-enfants, Bruce Lee"
    }, {
      "language" : "ro",
      "string" : "Dă-mi nepoții lui Bruce Lee.",
      "keywords" : "Bruce Lee, nepoți"
    }, {
      "language" : "es",
      "string" : "Dame todos los nietos de Bruce Lee.",
      "keywords" : "Bruce Lee, nietos"
    }, {
      "language" : "nl",
      "string" : "Toon alle kleinkinderen van Bruce Lee.",
      "keywords" : "Bruce Lee, kleinkinderen"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "c" ]
      },
      "results" : {
        "bindings" : [ {
          "c" : {
            "type" : "literal",
            "value" : "1"
          }
        } ]
      }
    } ]
  }, {
    "id" : "158",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.",
      "keywords" : "HBO-Fernsehserie, Sopranos, erste Staffel, Episode"
    }, {
      "language" : "ru",
      "string" : "Список все эпизоды из  первый время года из  ГБО телевидение серии  Сопрано! ",
      "keywords" : "ГБО ,  телевидение серии ,  Сопрано ,  первый время года ,  эпизод "
    }, {
      "language" : "pt",
      "string" : "Lista todos episódios do a primeiro estação do a HBO televisão Series o Sopranos! ",
      "keywords" : "HBO ,  televisão Series ,  Sopranos ,  primeiro estação ,  episódio "
    }, {
      "language" : "en",
      "string" : "List all episodes of the first season of the HBO television series The Sopranos!",
      "keywords" : "HBO, television series, Sopranos, first season, episode"
    }, {
      "language" : "hi_IN",
      "string" : "एचबीओ टेलीविजन श्रृंखला द सोप्रानोस! के पहले सीज़न के सभी एपिसोड की सूची बनाएं ।",
      "keywords" : "एचबीओ, टेलीविजन श्रृंखला, द सोप्रानोस!, पहले सीज़न, सभी एपिसोड"
    }, {
      "language" : "fa",
      "string" : "همه قسمت های فصل اول سریال سوپرانو شبکه HBO را لیست کن.",
      "keywords" : "HBO, سریال, سوپرانو, اولین فصل, قسمت"
    }, {
      "language" : "it",
      "string" : "Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos!",
      "keywords" : "serie televisiva di HBO, i Sopranos, prima stagione, episodio"
    }, {
      "language" : "fr",
      "string" : "Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.",
      "keywords" : "épisodes de la première saison, HBO, les Sopranos"
    }, {
      "language" : "ro",
      "string" : "Listă toate episoade de  primul sezon de  HBO televiziune serie  Sopranos! ",
      "keywords" : "HBO ,  televiziune serie ,  Sopranos ,  primul sezon ,  episod "
    }, {
      "language" : "es",
      "string" : "Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.",
      "keywords" : "serie televisiva de HBO, Los Sopranos, primera época, episodios"
    }, {
      "language" : "nl",
      "string" : "Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.",
      "keywords" : "HBO-serie, The Sopranos, eerste seizoen, aflevering"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Isabella_(The_Sopranos)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Meadowlands_(The_Sopranos)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Boca_(The_Sopranos)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nobody_Knows_Anything"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pax_Soprana"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Hit_Is_a_Hit"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Denial,_Anger,_Acceptance"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/College_(The_Sopranos)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/46_Long"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Sopranos_(episode)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Down_Neck"
          }
        } ]
      }
    } ]
  }, {
    "id" : "249",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Liste alle Musicals mit Musik von Elton John auf.",
      "keywords" : "Musicals, Musik von, Elton John"
    }, {
      "language" : "en",
      "string" : "List all the musicals with music by Elton John.",
      "keywords" : "musicals, music by, Elton John"
    }, {
      "language" : "hi_IN",
      "string" : "एल्टन जॉन द्वारा संगीत के साथ सभी संगीतों को सूचीबद्ध करें।",
      "keywords" : "एल्टन जॉन का संगीत"
    }, {
      "language" : "it",
      "string" : "Elenca tutti i musicals con musiche di Elton John.",
      "keywords" : "musicals, musiche, Elton John"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les musicals avec de la musique de de Elton John.",
      "keywords" : "musicals, musique, Elton John"
    }, {
      "language" : "ro",
      "string" : "Listează toate muzicalurile cu muzică de Elton John.",
      "keywords" : "muzicaluri, muzică de Elton John"
    }, {
      "language" : "es",
      "string" : "Dame todos los musicales con música de Elton John.",
      "keywords" : "musicales, música, Elton John"
    }, {
      "language" : "nl",
      "string" : "Toen een lijst van alle musicals met muziek van Elton John.",
      "keywords" : "musicals, muziek van, Elton John"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_Jr_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lestat_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aida_(musical)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "260",
    "answertype" : "number",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Gib mir die Laufzeit von Toy Story.",
      "keywords" : "Laufzeit, Toy Story"
    }, {
      "language" : "ru",
      "string" : "Дайте меня  время выполнения из Игрушка История. ",
      "keywords" : "время выполнения ,  Игрушка История "
    }, {
      "language" : "pt",
      "string" : "Dar mim a tempo de execução do Brinquedo História. ",
      "keywords" : "tempo de execução ,  Brinquedo História "
    }, {
      "language" : "en",
      "string" : "Give me the runtime of Toy Story.",
      "keywords" : "runtime, Toy Story"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे खिलौना कहानी के रनटाइम बताओ।",
      "keywords" : "क्रम ,  खिलौना कहानी "
    }, {
      "language" : "fa"
    }, {
      "language" : "it",
      "string" : "Dammi la durata di Toy Story.",
      "keywords" : "durata, Toy Story"
    }, {
      "language" : "fr",
      "string" : "Donnez-moi la durée de Toy Story.",
      "keywords" : "durée, Toy Story"
    }, {
      "language" : "ro",
      "keywords" : "rulare ,  Jucărie Poveste "
    }, {
      "language" : "es",
      "keywords" : "tiempo de ejecución ,  Juguete Historia "
    }, {
      "language" : "nl",
      "keywords" : "runtime ,  Speelgoed Verhaal "
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "c" ]
      },
      "results" : {
        "bindings" : [ {
          "c" : {
            "type" : "literal",
            "value" : "4860.0"
          }
        } ]
      }
    } ]
  }, {
    "id" : "275",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Liste die Kinder von Margaret Thatcher auf.",
      "keywords" : "Margaret Thatcher, Kind"
    }, {
      "language" : "ru",
      "string" : "Список  дети из Маргарет Тетчер. ",
      "keywords" : "Маргарет Thatcher ,  ребенок "
    }, {
      "language" : "pt",
      "string" : "Lista a crianças do Margarida Thatcher. ",
      "keywords" : "Margarida Thatcher ,  criança "
    }, {
      "language" : "en",
      "string" : "List the children of Margaret Thatcher.",
      "keywords" : "Margaret Thatcher, child"
    }, {
      "language" : "hi_IN",
      "string" : "मार्गरेट थैचर के बच्चों की सूची बनाएं।",
      "keywords" : "मार्गरेट थैचर, बच्चों"
    }, {
      "language" : "fa",
      "string" : "بچه های مارگارت تاچر را لیست کن.",
      "keywords" : "مارگارت تاچر, بچه"
    }, {
      "language" : "it",
      "string" : "Elenca i figli di Margaret Thatcher.",
      "keywords" : "Margaret Thatcher, figlio"
    }, {
      "language" : "fr",
      "string" : "Donnes-moi tous les enfants de Margaret Thatcher.",
      "keywords" : "enfants, Margaret Thatcher"
    }, {
      "language" : "ro",
      "string" : "Listă  copii de Margaret Thatcher. ",
      "keywords" : "Margaret Thatcher ,  copil "
    }, {
      "language" : "es",
      "string" : "Dame una lista de los hijos de Margaret Thatcher.",
      "keywords" : "Margaret Thatcher, hijos"
    }, {
      "language" : "nl",
      "string" : "Noem alle kinderen van Margaret Thatcher.",
      "keywords" : "kinderen, Margaret Thatcher"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Carol_Thatcher"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mark_Thatcher"
          }
        } ]
      }
    } ]
  }, {
    "id" : "290",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Liste alle Spiele von GMT auf.",
      "keywords" : "Spiel, GMT"
    }, {
      "language" : "ru",
      "string" : "Список все игры от ВРЕМЯ ПО ГРИНВИЧУ. ",
      "keywords" : "игра ,  время по Гринвичу "
    }, {
      "language" : "pt",
      "string" : "Lista todos jogos de GMT. ",
      "keywords" : "jogos ,  GMT "
    }, {
      "language" : "en",
      "string" : "List all games by GMT.",
      "keywords" : "game, GMT"
    }, {
      "language" : "hi_IN",
      "string" : "जीएमटी द्वारा सभी खेलों की सूची बनाएं।",
      "keywords" : "जीएमटी, खेल"
    }, {
      "language" : "fa",
      "string" : "تسرهف  همه  اه یزاب  طسوت  TMG  ",
      "keywords" : "یزاب  ,  TMG  "
    }, {
      "language" : "it",
      "string" : "Elenca tutti i giochi di GMT.",
      "keywords" : "gioco, GMT"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les jeux de GMT.",
      "keywords" : "jeux, GMT"
    }, {
      "language" : "ro",
      "string" : "Listă toate jocuri de GMT. ",
      "keywords" : "joc ,  GMT "
    }, {
      "language" : "es",
      "string" : "Dame todos los juegos de GMT.",
      "keywords" : "juegos, GMT"
    }, {
      "language" : "nl",
      "string" : "Noem alle spelen van GMT.",
      "keywords" : "spel, GMT"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Washington's_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fields_of_Fire_(game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_World_At_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sword_of_Rome"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Twilight_Struggle"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chandragupta_(board_game)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "296",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Gib mir alle Bandmitglieder von Prodigy.",
      "keywords" : "Bandmitglied, Prodigy"
    }, {
      "language" : "ru",
      "string" : "Дайте меня все члены из Prodigy. ",
      "keywords" : "член ,  одаренный человек "
    }, {
      "language" : "pt",
      "string" : "Dar mim todos membros do Prodígio. ",
      "keywords" : "membro ,  Prodígio "
    }, {
      "language" : "en",
      "string" : "Give me all members of Prodigy.",
      "keywords" : "member, Prodigy"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे प्रोडिजी के सभी सदस्यों की सूचि बतायें।",
      "keywords" : "प्रोडिजी, सदस्यों"
    }, {
      "language" : "fa",
      "string" : "تمام اعضای پرادیجی را لیست کن.",
      "keywords" : "اعضا، پرادیجی"
    }, {
      "language" : "it",
      "string" : "Dammi tutti i membri dei Prodigy.",
      "keywords" : "membri, Prodigy"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les membres de Prodigy.",
      "keywords" : "members, Prodigy"
    }, {
      "language" : "ro",
      "string" : "Dă-mi toții membrii Prodigy.",
      "keywords" : "membru, Prodigy"
    }, {
      "language" : "es",
      "string" : "Dame todos los miembros de la banda Prodigy.",
      "keywords" : "miembros de la banda Prodigy"
    }, {
      "language" : "nl",
      "string" : "Noem alle leden van Prodigy.",
      "keywords" : "leden, Prodigy"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Maxim_(musician)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Liam_Howlett"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Keith_Flint"
          }
        } ]
      }
    } ]
  }, {
    "id" : "347",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Zeig mir alle Bücher in Asimovs Foundation-Serie.",
      "keywords" : "Asimov, Foundation-Serie, Bücher"
    }, {
      "language" : "ru",
      "string" : "Показать меня все книги в Азимова Фонд серии. ",
      "keywords" : "книги ,  Азимов ,  Фонд серии "
    }, {
      "language" : "pt",
      "string" : "exposição mim todos livros dentro Asimov's Fundação Series. ",
      "keywords" : "livros ,  Asimov ,  Fundação Series "
    }, {
      "language" : "en",
      "string" : "Show me all books in Asimov's Foundation series.",
      "keywords" : "books, Asimov, Foundation series"
    }, {
      "language" : "hi_IN",
      "string" : "असिमोव की फाउंडेशन श्रृंखला की सारी पुस्तकों की सूचि दिखाएं।",
      "keywords" : "असिमोव, फाउंडेशन श्रृंखला, पुस्तकों"
    }, {
      "language" : "fa",
      "string" : "مجموعه کتاب های آسیموف چند کتاب دارد؟",
      "keywords" : "مجموعه کتاب های، آسیموف، کتاب"
    }, {
      "language" : "it",
      "string" : "Mostrami tutti i libri del Ciclo della Fondazione di Asimov",
      "keywords" : "libri, Ciclo della Fondazione, Asimov"
    }, {
      "language" : "fr",
      "string" : "Montres-moi tous les livres du Cycle de Fondation d'Asimov.",
      "keywords" : "livres, Cycle de Fondation, Asimov"
    }, {
      "language" : "ro",
      "string" : "Arată-mi toate cărțile din seria Fundația de Asimov",
      "keywords" : "cărți, seria Fundația, Asimov"
    }, {
      "language" : "es",
      "string" : "Muéstrame todos los libros en la serie Fundación de Asimov",
      "keywords" : "libros, serie Fundación Asimov"
    }, {
      "language" : "nl",
      "string" : "Toon alle boeken die bij de Foundation-serie horen.",
      "keywords" : "boeken, Foundation-serie"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Originist"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Foundation_and_Earth"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Forward_the_Foundation"
          }
        } ]
      }
    } ]
  }, {
    "id" : "367",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Gib mir die Enkel von Elvis Presley.",
      "keywords" : "Elvis Presley, Enkel"
    }, {
      "language" : "ru",
      "string" : "Дайте меня  внучата из Элвис Presley. ",
      "keywords" : "Элвис Presley ,  внучата "
    }, {
      "language" : "pt",
      "string" : "Dar mim a netos do Elvis Presley ",
      "keywords" : "Elvis Presley ,  netos "
    }, {
      "language" : "en",
      "string" : "Give me the grandchildren of Elvis Presley.",
      "keywords" : "Elvis Presley, grandchildren"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे एल्विस प्रेस्ली के पोतों के नाम दे। ",
      "keywords" : "एल्विस प्रेस्ली, पोतो के नाम"
    }, {
      "language" : "fa",
      "string" : "نوه های الویس پرسلی را لیست کن.",
      "keywords" : "نوه های، الویس پرسلی"
    }, {
      "language" : "it",
      "string" : "Dammi i nipoti di Elvis Presley.",
      "keywords" : "Elvis Presley, nipoti"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les petit-enfants de Elvis Presley.",
      "keywords" : "petit-enfants, Elvis Presley"
    }, {
      "language" : "ro",
      "string" : "Dă-mi nepoții lui Elvis Presley.",
      "keywords" : "Elvis Presley, nepoți"
    }, {
      "language" : "es",
      "string" : "Dame todos los nietos de Elvis Presley.",
      "keywords" : "Elvis Presley, nietos"
    }, {
      "language" : "nl",
      "string" : "Toon alle kleinkinderen van Elvis Presley.",
      "keywords" : "Elvis Presley, kleinkinderen"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Riley_Keough"
          }
        } ]
      }
    } ]
  }, {
    "id" : "383",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Zeig mir das Buch, das Muhammad Ali geschrieben hat.",
      "keywords" : "Buch, geschrieben, Muhammad Ali"
    }, {
      "language" : "ru",
      "string" : "Показать меня  книга что Мухаммед или написал. ",
      "keywords" : "книга ,  писал ,  Мухаммед или "
    }, {
      "language" : "pt",
      "string" : "exposição mim a livro aquele Maomé Mas escrevi. ",
      "keywords" : "livro ,  escrevi ,  Maomé Mas "
    }, {
      "language" : "en",
      "string" : "Show me the book that Muhammad Ali wrote.",
      "keywords" : "book, wrote, Muhammad Ali"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे किताब बताओ जो मुहम्मद अली ने लिखी थी।",
      "keywords" : "किताब, मुहम्मद अली, लिखी"
    }, {
      "language" : "fa",
      "string" : "  نوشت.  اما  محمد  آن  کتاب  این  من  نمایش",
      "keywords" : "  کتاب,    نوشت,    اما  محمد"
    }, {
      "language" : "it",
      "string" : "Mostrami il libro scritto da Muhammad Ali.",
      "keywords" : "libro, autore, Muhammad Ali"
    }, {
      "language" : "fr",
      "string" : "Donne-moi le livre écrit par Muhammad Ali.",
      "keywords" : "livre, par Muhammad Ali"
    }, {
      "language" : "ro",
      "string" : "Arată-mi cartea pe care a scris-o Muhammad Ali.",
      "keywords" : "carte, scris, Muhammad Ali"
    }, {
      "language" : "es",
      "string" : "Muéstrame el libro escrito por Muhammad Ali.",
      "keywords" : "libro, autor, Muhammad Ali"
    }, {
      "language" : "nl",
      "string" : "Toen het boek dat Muhammad Ali heeft geschreven.",
      "keywords" : "boek, geschreven, Muhammad Ali"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Greatest:_My_Own_Story"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
          }
        } ]
      }
    } ]
  } ]
}
