{
  "dataset" : {
    "id" : "qald-9-train-multilingual"
  },
  "questions" : [ {
    "id" : "403",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Gib mir alle in Schweden geborenen Ozeanographen.",
      "keywords" : "Schweden, geborene, Ozeanographen"
    }, {
      "language" : "ru",
      "string" : "Дайте меня все шведский океанографы. ",
      "keywords" : "шведский ,  океанограф "
    }, {
      "language" : "pt",
      "string" : "Dar mim todos sueco oceanógrafos. ",
      "keywords" : "sueco ,  oceanógrafo "
    }, {
      "language" : "en",
      "string" : "Give me all Swedish oceanographers.",
      "keywords" : "Swedish, oceanographer"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे सभी स्वीडिश महासागरीय वैज्ञानिकों की सूचि बतायें।",
      "keywords" : "स्वीडिश, महासागरीय वैज्ञानिक"
    }, {
      "language" : "fa",
      "string" : "  اقیانوس شناسان  سوئدی  همه  من  دادن",
      "keywords" : "  سوئدی,    اقیانوس شناس"
    }, {
      "language" : "it",
      "string" : "Dammi tutti gli oceanografi svedesi.",
      "keywords" : "svedesi, oceanografi"
    }, {
      "language" : "fr",
      "string" : "Donne-moi tous les océanographes suédois.",
      "keywords" : "Océanographes, suédois"
    }, {
      "language" : "ro",
      "string" : "Dă-mi toți oceanografii suedezi.",
      "keywords" : "oceanograf, suedez"
    }, {
      "language" : "es",
      "string" : "Dame todos los oceanógrafos suecos.",
      "keywords" : "oceanógrafos suecos"
    }, {
      "language" : "nl",
      "string" : "Toon alle Zweedse oceanograafen.",
      "keywords" : "Zweedse, oceanograafen"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Vagn_Walfrid_Ekman"
          }
        } ]
      }
    } ]
  }, {
    "id" : "412",
    "answertype" : "resource",
    "aggregation" : false,
    "onlydbo" : true,
    "hybrid" : false,
    "question" : [ {
      "language" : "de",
      "string" : "Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.",
      "keywords" : "Schauspieler, mitspielen, Last Action Hero"
    }, {
      "language" : "ru",
      "string" : "Дайте меня все актеры в главной роли в Последний действие Hero. ",
      "keywords" : "актер ,  в главной роли ,  Последний действие герой "
    }, {
      "language" : "pt",
      "string" : "Dar mim todos atores estrelando dentro Último Açao Herói. ",
      "keywords" : "ator ,  estrelando ,  Último Açao Herói "
    }, {
      "language" : "en",
      "string" : "Give me all actors starring in Last Action Hero.",
      "keywords" : "actor, starring, Last Action Hero"
    }, {
      "language" : "hi_IN",
      "string" : "मुझे लास्ट एक्शन हीरो में अभिनीत सभी कलाकारों के नाम बतायें दो।",
      "keywords" : "लास्ट एक्शन हीरो, सभी कलाकार, नाम"
    }, {
      "language" : "fa",
      "string" : "  قهرمان  عمل  آخر  که در  بازیگران  بازیگران  همه  من  دادن",
      "keywords" : "  بازیگر,    بازیگران,    قهرمان  عمل  آخر"
    }, {
      "language" : "it",
      "string" : "Dammi tutti gli attori che hanno recitato in Last Action Hero.",
      "keywords" : "attori, Last Action Hero"
    }, {
      "language" : "fr",
      "string" : "Noem alle acteurs uit de film Last Action Hero.",
      "keywords" : "acteurs, Last Action Hero"
    }, {
      "language" : "ro",
      "string" : "Dă-mi toți actorii cu roluri principale în Last Action Hero.",
      "keywords" : "actor, rol principal, Last Action Hero"
    }, {
      "language" : "es",
      "string" : "Dame todos los actores que hayan actuado en Last Action Hero.",
      "keywords" : "actores, Last Action Hero"
    }, {
      "language" : "nl",
      "string" : "Noem alle acteurs uit de film Last Action Hero.",
      "keywords" : "acteur, Last Action Hero"
    } ],
    "query" : {
      "sparql" : "PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tom_Noonan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/F._Murray_Abraham"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arnold_Schwarzenegger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mercedes_Ruehl"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Charles_Dance"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Art_Carney"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Frank_McRae"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Austin_O'Brien"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Robert_Prosky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Anthony_Quinn"
          }
        } ]
      }
    } ]
  } ]
}
