[
    {
        "_id": "4842", 
        "corrected_question": "Which famous political figure appointed william cushing, and also founded Pittsburgh>", 
        "intermediary_question": "What is the <founders> of the <Pittsburgh> and <appointer> of the <William Cushing>", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pittsburgh> <http://dbpedia.org/ontology/founder> ?uri. <http://dbpedia.org/resource/William_Cushing> <http://dbpedia.org/ontology/appointer> ?uri} ", 
        "sparql_template_id": 16
    }, 
    {
        "_id": "2633", 
        "corrected_question": "Count all those whose youth club was managed by Luis Enrique.", 
        "intermediary_question": "How many <owls> are there whose <youthclubs>'s <team manager> is <Luis Enrique (footballer)> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", 
        "sparql_template_id": 106
    }, 
    {
        "_id": "1052", 
        "corrected_question": "Is Microsoft office written in C++", 
        "intermediary_question": "Is <C++> the <programming language> of <Microsoft Office>?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Microsoft_Office> <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C++> }", 
        "sparql_template_id": 151
    }, 
    {
        "_id": "100", 
        "corrected_question": "Give me the total number of commander of the military conflicts whose commander is Roundhead (Wyandot).", 
        "intermediary_question": "Give me the total number of <commander> of the <military conflicts> whose <commander> is <Roundhead (Wyandot)>.", 
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)> . ?x <http://dbpedia.org/ontology/commander> ?uri }", 
        "sparql_template_id": 111
    }, 
    {
        "_id": "4838", 
        "corrected_question": "Which company's division is Audi India? Correct Question", 
        "intermediary_question": "What is the <company> whose <divisions> is <Audi India>?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Audi_India> } ", 
        "sparql_template_id": 1
    }, 
    {
        "_id": "877", 
        "corrected_question": "Count all the things licensed as Software as a service.", 
        "intermediary_question": "How many <software> are there whose <content license> is <Software as a service>?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . }", 
        "sparql_template_id": 101
    }, 
    {
        "_id": "893", 
        "corrected_question": "Does Walt Disney Studio have a subsidiary called PixarCascadia_", 
        "intermediary_question": "Is <Pixar> the <subsidiary> of <Walt Disney Studios (division)>?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Walt_Disney_Studios_(division)> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar> }", 
        "sparql_template_id": 152
    }, 
    {
        "_id": "3654", 
        "corrected_question": "List the religions of the commanders of Royal Thai Army.", 
        "intermediary_question": "What is the <religion> of the <office holder> who is the <notable commanders> of <Royal Thai Army> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Royal_Thai_Army> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "2450", 
        "corrected_question": "Give me a count of everything made by the company which offers electronical manufacturing too.", 
        "intermediary_question": "What is the total number of <information appliances> whose <made by>'s <service> is <Electronics manufacturing services>?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }", 
        "sparql_template_id": 106
    }, 
    {
        "_id": "2146", 
        "corrected_question": "Name everyone working for a company owned by Roman Abramovich.", 
        "intermediary_question": "Who is the <person> whose <craft>'s <owning company> is <Roman Abramovich>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }", 
        "sparql_template_id": 6
    }, 
    {
        "_id": "4415", 
        "corrected_question": "How many bacterias have taxonomy as Bacillales and domain as Bacteria? ", 
        "intermediary_question": "What is the total number of <bacterias> whose <order (taxonomy)> is <Bacillales> and <domain> is <Bacteria>?", 
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Bacillales> . ?uri <http://dbpedia.org/property/domain> <http://dbpedia.org/resource/Bacteria> } ", 
        "sparql_template_id": 108
    }, 
    {
        "_id": "577", 
        "corrected_question": "Whose doctoral student is etienne bieler\\xc9tienne_Bi\\xe9ler", 
        "intermediary_question": "Who is the <scientist> whose <doctoral student> is <tienne Biler>?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler> } ", 
        "sparql_template_id": 1
    }, 
    {
        "_id": "4525", 
        "corrected_question": "Name the ones who debuted in the San Francisco 49ers.", 
        "intermediary_question": "Who are the <american football players> whose <debut team> is <San Francisco 49ers>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/debutTeam> <http://dbpedia.org/resource/San_Francisco_49ers>  . }", 
        "sparql_template_id": 1
    }, 
    {
        "_id": "4741", 
        "corrected_question": "Name the part of Liverpool city region >", 
        "intermediary_question": "What are the <part> of Liverpool City Region?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liverpool_City_Region> <http://dbpedia.org/ontology/part> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "4299", 
        "corrected_question": "Count the different religions followed by Second Lieutenants in military.", 
        "intermediary_question": "How many <religious affiliation> are there, of the <office holders> whose <military rank> is <Second lieutenant> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Second_lieutenant> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "3676", 
        "corrected_question": "Is Eddie Bravo the trainer of Alan Jouban", 
        "intermediary_question": "Is <Eddie Bravo> the <trainer> of <Alan Jouban>?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Alan_Jouban> <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Eddie_Bravo> }", 
        "sparql_template_id": 152
    }, 
    {
        "_id": "3526", 
        "corrected_question": "name the home stadium of FC Spartak Moscow season 2011-12", 
        "intermediary_question": "What is the <home stadium> of 201112 FC Spartak Moscow season ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "122", 
        "corrected_question": "Count all those who've played for the youth club which owns the Rosario, Santa Fe stadium.", 
        "intermediary_question": "Give the total number of <owls> whose <youthclubs>'s <ground> is <Rosario, Santa Fe>.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Rosario,_Santa_Fe> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", 
        "sparql_template_id": 106
    }, 
    {
        "_id": "2710", 
        "corrected_question": "Count the different religions practiced by people who are in the Malaysian and Chinese association.", 
        "intermediary_question": "What is the total number of <religion> of the <politicians> whose <member of political party> is <Malaysian Chinese Association> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Malaysian_Chinese_Association> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "2654", 
        "corrected_question": "List all those whose relatives' nationality is United States.", 
        "intermediary_question": "List the <architects> whose <relative>'s <nationality> is <United States>.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/ontology/relative> ?x  . }", 
        "sparql_template_id": 6
    }, 
    {
        "_id": "2418", 
        "corrected_question": "Count the  origin of the beverages which have been originated in england /", 
        "intermediary_question": "Count the other <origin> of the <beverages> whose <origin> is <England>.", 
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/origin> ?uri }", 
        "sparql_template_id": 111
    }, 
    {
        "_id": "2284", 
        "corrected_question": "Which type of  building is Qun Thnh Temple ?", 
        "intermediary_question": "What is the <building type> of Qun Thnh Temple ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Qu\u00e1n_Th\u00e1nh_Temple> <http://dbpedia.org/property/buildingType> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "4561", 
        "corrected_question": "Count the religions followed by people living in British Columbia.", 
        "intermediary_question": "Count the <religious affiliation> of the <politicians> whose <official residence> is <British Columbia>.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/British_Columbia> . ?x <http://dbpedia.org/property/religion> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "4038", 
        "corrected_question": "For everyone who died in paris, count their different fields of work.", 
        "intermediary_question": "Give the total number of <fields> of the <scientists> whose <location of death> is <Paris>.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris> . ?x <http://dbpedia.org/property/fields> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "2650", 
        "corrected_question": "Which minister was responsible for Kriminalpolizie?", 
        "intermediary_question": "Who is the <leader> of Kriminalpolizei ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kriminalpolizei> <http://dbpedia.org/ontology/leader> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "463", 
        "corrected_question": "Name the members of youth clubs which have Camp Nou as their homeground.", 
        "intermediary_question": "What are the <owls> whose <youthclubs>'s <ground> is <Camp Nou>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Camp_Nou> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", 
        "sparql_template_id": 6
    }, 
    {
        "_id": "239", 
        "corrected_question": "Count the number of actors in Lucy Sullivan Is Getting Married.", 
        "intermediary_question": "Count the <actress> in <Lucy Sullivan Is Getting Married>?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married> <http://dbpedia.org/property/starring> ?uri  . }", 
        "sparql_template_id": 102
    }, 
    {
        "_id": "4676", 
        "corrected_question": "Estimate the number of sports divisions at the universities under international association of universities.", 
        "intermediary_question": "Give the total number of <sport> of the <universities> whose <affiliation> is <International Association of Universities>.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "2512", 
        "corrected_question": "Name a few whose live in a place where Indian English is an official language", 
        "intermediary_question": "What are the <office holders> whose <official residence>'s <official language> is <Indian English>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }", 
        "sparql_template_id": 6
    }, 
    {
        "_id": "309", 
        "corrected_question": "Give me a count of everything under the archipelago, where Papeete is the biggest town.", 
        "intermediary_question": "Give the total number of <owls> whose <archipelago>'s <largest city> is <Papeete>.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }", 
        "sparql_template_id": 106
    }, 
    {
        "_id": "3159", 
        "corrected_question": "Who all have been canonized by Pope Paul VI", 
        "intermediary_question": "Who are the <saints> whose <canonized by> is <Pope Paul VI>?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Pope_Paul_VI> } ", 
        "sparql_template_id": 1
    }, 
    {
        "_id": "73", 
        "corrected_question": "List the base currency of the country whose anthem is Oj, svijetla majska zoro.", 
        "intermediary_question": "List the <base currency> of the <owls> whose <anthem> is <Oj, svijetla majska zoro>.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }", 
        "sparql_template_id": 5
    }, 
    {
        "_id": "4230", 
        "corrected_question": "List the children of the parent of Marvin Bush.", 
        "intermediary_question": "What is the <children> of the <office holder> who is the <parent> of <Marvin Bush> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marvin_Bush> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/property/children> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "2995", 
        "corrected_question": "List down all the cast members of Tony n' Tina's Wedding ?", 
        "intermediary_question": "Who is the <cast member> of Tony n' Tina's Wedding ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tony_n'_Tina's_Wedding> <http://dbpedia.org/property/starring> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "1427", 
        "corrected_question": "Of how many battles is Chickasaw Campaign of 1736 consisted?", 
        "intermediary_question": "What is the <combatant> of Chickasaw Campaign of 1736 ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chickasaw_Campaign_of_1736> <http://dbpedia.org/property/combatant> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "620", 
        "corrected_question": "How many ", 
        "intermediary_question": "Give me a count of <basketball players> whose <member of sports team> is <Chicago Bulls>?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls>  . }", 
        "sparql_template_id": 101
    }, 
    {
        "_id": "4197", 
        "corrected_question": "What is the almamater of the successor of F. A. Little, Jr.? ", 
        "intermediary_question": "What is the <alma mater> of the <judge> who is the <successor> of <F. A. Little, Jr.> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/F._A._Little,_Jr.> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "1616", 
        "corrected_question": "List everything in which saxophone players have been casted.", 
        "intermediary_question": "What are the <owls> whose <actress>'s <plays> is <Saxophone>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Saxophone> . ?uri <http://dbpedia.org/property/starring> ?x  . }", 
        "sparql_template_id": 6
    }, 
    {
        "_id": "30", 
        "corrected_question": "Name the mascot of the military branch of William Harper.", 
        "intermediary_question": "What is the <mascot> of the <military unit> which is the <military branch> of <William Harper (Rhodesian politician)> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "1207", 
        "corrected_question": "Is lion an animal?", 
        "intermediary_question": "Is <Animal> the <kingdom> of <Lion>?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Lion> <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> }", 
        "sparql_template_id": 151
    }, 
    {
        "_id": "245", 
        "corrected_question": "Count all the scientologists.", 
        "intermediary_question": "Give me a count of <people> whose <religion> is <Scientology>?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Scientology>  . }", 
        "sparql_template_id": 101
    }, 
    {
        "_id": "2314", 
        "corrected_question": "What is a salthill?", 
        "intermediary_question": "What is the <type> of Salthill ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "3467", 
        "corrected_question": "Which state is the birth location of Ann Monroe Gilchrist Strong? ", 
        "intermediary_question": "What is the <sovereign state> of the <settlement> which is the <birth location> of <Ann Monroe Gilchrist Strong> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "932", 
        "corrected_question": "List the awards given to the relatives of Gregorios Bernardakis.", 
        "intermediary_question": "What is the <award received> of the <writer> who is the <relative> of <Gregorios Bernardakis> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gregorios_Bernardakis> <http://dbpedia.org/ontology/relative> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "1104", 
        "corrected_question": " Count the participants of the NBA.", 
        "intermediary_question": "Give me a count of <basketball players> whose <league> is <National Basketball Association>?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/National_Basketball_Association>  . }", 
        "sparql_template_id": 101
    }, 
    {
        "_id": "1774", 
        "corrected_question": "Count the total religions followed by the ones living in England.", 
        "intermediary_question": "Count the <religious affiliation> of the <people> whose <official residence> is <England>.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/religion> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "4774", 
        "corrected_question": "Is Serbian Titieca a doctoral student of Werner Heisenberghttp://dbpedia.org/resource/Werner_Heisenberg", 
        "intermediary_question": "Is <erban ieica> the <doctoral student> of <Werner Heisenberg>?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Werner_Heisenberg> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica> }", 
        "sparql_template_id": 151
    }, 
    {
        "_id": "2321", 
        "corrected_question": "Does the white river flow into the connecticut river{u'_id': u'97e02dcf44aa43c1b7cc7a7c155b118f',", 
        "intermediary_question": "Is <White River (Vermont)> the <right tributary> of <Connecticut River>?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Connecticut_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/White_River_(Vermont)> }", 
        "sparql_template_id": 151
    }, 
    {
        "_id": "752", 
        "corrected_question": "Who wrote The Times They Are a-Changin?", 
        "intermediary_question": "Who is the <written by> of The Times They Are a-Changin' (musical) ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Times_They_Are_a-Changin'_(musical)> <http://dbpedia.org/ontology/musicBy> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "2629", 
        "corrected_question": "Where did ed podolak go to high school", 
        "intermediary_question": "What is the <highschool> of Ed Podolak ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ed_Podolak> <http://dbpedia.org/ontology/highschool> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "4073", 
        "corrected_question": "Give me the number of home stadiums of teams managed by John Spencer.", 
        "intermediary_question": "What is the total number of <home stadium> of the <soccer club seasons> whose <manager> is <John Spencer (Scottish footballer)> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "1278", 
        "corrected_question": "Where is the origin of Filbert's Old Time Root Beer ?", 
        "intermediary_question": "What is the <origin> of Filbert's Old Time Root Beer ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Filbert's_Old_Time_Root_Beer> <http://dbpedia.org/ontology/origin> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "1226", 
        "corrected_question": "Count the number of judges who've come on CTV network shows.", 
        "intermediary_question": "Give the total number of <judges> of the <television shows> whose <network> is <CTV Television Network>.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> . ?x <http://dbpedia.org/property/judges> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "3172", 
        "corrected_question": "Give me the count of artist in the company whose Artist is Jean- Fran\u00e7ois Cot\u00e9 ?", 
        "intermediary_question": "Give me the count of <Artist> of the <companies> whose <Artist> is <Jean- Fran\u00e7ois  Cot\u00e9>>.", 
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9> . ?x <http://dbpedia.org/property/artist> ?uri }", 
        "sparql_template_id": 111
    }, 
    {
        "_id": "1836", 
        "corrected_question": "Which countries share a similar sociocultural and ethnic heritage of that of Native Indonesians?", 
        "intermediary_question": "What are the <region> of Native Indonesians?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Native_Indonesians> <http://dbpedia.org/property/region> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "4048", 
        "corrected_question": "List the sports played in private universities.", 
        "intermediary_question": "What is the <sport> of the <universities> which are <Private university>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Private_university> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", 
        "sparql_template_id": 5
    }, 
    {
        "_id": "226", 
        "corrected_question": "Who is the performer of album which has the song \"To Where You Are\" ?", 
        "intermediary_question": "What is the <performer> of the <album> which is the <album> of <To Where You Are> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/To_Where_You_Are> <http://dbpedia.org/ontology/album> ?x . ?x <http://dbpedia.org/ontology/artist> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "1416", 
        "corrected_question": "Who are some authoritative persons on the matter of Megabalanus concinnus?", 
        "intermediary_question": "Who is the <binomial authority> of Megabalanus concinnus ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Megabalanus_concinnus> <http://dbpedia.org/ontology/binomialAuthority> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "2159", 
        "corrected_question": "List the awards won by the wife of Ingrid von Rosen.", 
        "intermediary_question": "What is the <awards> of the <person> who is the <wife> of <Ingrid von Rosen> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingrid_von_Rosen> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "4350", 
        "corrected_question": "Count the different genres of games published by Titus Software", 
        "intermediary_question": "How many <genre> are there, of the <video games> whose <publisher> is <Titus Software> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Titus_Software> . ?x <http://dbpedia.org/ontology/genre> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "779", 
        "corrected_question": "Count the awards given to the recepients of the Becket fund for religious liberty.", 
        "intermediary_question": "What is the total number of <awards> of the <writers> whose <honours> is <Becket Fund for Religious Liberty> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty> . ?x <http://dbpedia.org/property/awards> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "1688", 
        "corrected_question": "Count all the places where companies located in Ontario operate.", 
        "intermediary_question": "How many <locations> are there, of the <companies> whose <location city> is <Ontario> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "3320", 
        "corrected_question": "Count the awards won by the people who graduated from the National and Kapodistrian University of Athens.", 
        "intermediary_question": "How many <honours> are there, of the <scientists> whose <alma mater> is <National and Kapodistrian University of Athens> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> . ?x <http://dbpedia.org/ontology/award> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "1234", 
        "corrected_question": "?What are the airline hubs of Cascade Airways", 
        "intermediary_question": "What is the <hubs> of Cascade Airways ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cascade_Airways> <http://dbpedia.org/property/hubs> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "1587", 
        "corrected_question": "Count the different alma maters of people employed by the CNN", 
        "intermediary_question": "Give the total number of <alma mater> of the <people> whose <employer> is <CNN>.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "1950", 
        "corrected_question": "where did Alfred Tarnowski die?", 
        "intermediary_question": "What is the <PLACE OF DEATH> of Alfred Tarnowski ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alfred_Tarnowski> <http://dbpedia.org/property/placeOfDeath> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "2902", 
        "corrected_question": "Name a famous relative of barry voight", 
        "intermediary_question": "Who is the <person> whose <relative> is <Barry Voight>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>  . }", 
        "sparql_template_id": 1
    }
]