[
    {
        "_id": "237", 
        "corrected_question": "List places that are associated to cities in the state of Mecklenburg-Vorpommern.", 
        "intermediary_question": "List the <lakes> whose <cities>'s <federal state> is <Mecklenburg-Vorpommern>.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/federalState> <http://dbpedia.org/resource/Mecklenburg-Vorpommern> . ?uri <http://dbpedia.org/property/cities> ?x  . }", 
        "sparql_template_id": 6
    }, 
    {
        "_id": "4501", 
        "corrected_question": "Who was succeeded by Arthur Gegei as the office ho0lder ?", 
        "intermediary_question": "Who is the <office holder> whose <successor> is <Artr Grgei>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Art\u00far_G\u00f6rgei>  . }", 
        "sparql_template_id": 1
    }, 
    {
        "_id": "4015", 
        "corrected_question": "Where is the mouth of the river whose tributary is Bjelimi\u0107ka  Rijeka ?", 
        "intermediary_question": "What is the <mouth country> of the <place> whose <right tributary> is <Bjelimi\u0107ka  Rijeka>> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }", 
        "sparql_template_id": 5
    }, 
    {
        "_id": "2666", 
        "corrected_question": "Name some books by Spanish speaking authors.", 
        "intermediary_question": "What are the <books> whose <author>'s <language> is <Spanish language>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Spanish_language> . ?uri <http://dbpedia.org/property/author> ?x  . }", 
        "sparql_template_id": 6
    }, 
    {
        "_id": "1496", 
        "corrected_question": "Give me the characters who last appeared in Star Wars Episode 3", 
        "intermediary_question": "Who is the <fictional character> whose <last> is <Star Wars: Episode III  Revenge of the Sith>?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/last> <http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> } ", 
        "sparql_template_id": 1
    }, 
    {
        "_id": "4825", 
        "corrected_question": "Which river goes through cohoes, NY", 
        "intermediary_question": "What is the <river> of Cohoes, New York ?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cohoes,_New_York> <http://dbpedia.org/ontology/river> ?uri } ", 
        "sparql_template_id": 2
    }, 
    {
        "_id": "128", 
        "corrected_question": "Did Steve Sampson manage a club of Santa Clara university", 
        "intermediary_question": "Is <Santa Clara University> the <manager club> of <Steve Sampson>?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }", 
        "sparql_template_id": 152
    }, 
    {
        "_id": "1472", 
        "corrected_question": "Count the different causes of death of Christians.", 
        "intermediary_question": "How many <death cause> are there, of the <people> whose <religious affiliation> is <Christianity> ?", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }", 
        "sparql_template_id": 105
    }, 
    {
        "_id": "4198", 
        "corrected_question": "List the alma mater of the person who is wedded to Sissela Bok.", 
        "intermediary_question": "List the <alma mater> of the <office holders> whose <wed> is <Sissela Bok>.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Sissela_Bok> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }", 
        "sparql_template_id": 5
    }, 
    {
        "_id": "3427", 
        "corrected_question": "Mazhar Ul Haq High School, Beerwah is affiliated to Islamic Religion", 
        "intermediary_question": "Is <Islam> the <religious affiliation> of <Mazhar Ul Haq High School, Beerwah>?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah> <http://dbpedia.org/property/religiousAffiliation> <http://dbpedia.org/resource/Islam> }", 
        "sparql_template_id": 152
    }, 
    {
        "_id": "1273", 
        "corrected_question": "List all the tenants of the stadium where the WWF Summer Slam 2004 took place.", 
        "intermediary_question": "What is the <tenant> of the <stadium> which is the <venue> of <SummerSlam (2004)> ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }", 
        "sparql_template_id": 3
    }, 
    {
        "_id": "906", 
        "corrected_question": "Who is married to Tony Ramo", 
        "intermediary_question": "What <person>'s <partner> is <Tony Romo>", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Tony_Romo>  . }", 
        "sparql_template_id": 1
    }, 
    {
        "_id": "1245", 
        "corrected_question": "Name some people working at someplace owned by News Corp.", 
        "intermediary_question": "Who are the <people> whose <workplace>'s <owners> is <News Corp>?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/News_Corp> . ?uri <http://dbpedia.org/ontology/employer> ?x  . }", 
        "sparql_template_id": 6
    }
]